import React, {Component} from 'react';
import {Navbar, Nav, Container,Modal, Form, Button, FormControl } from "react-bootstrap";
import Stages from "./stages";

export default function Blog (){
    return(
        <>
            <Container fluid={true} className={'blog'}>

                <h1 className={'mt-3'}>Мы предлагаем!</h1>
                <div className={'blog-disc'}>
                    <ul>
                        <li className = {'list li1 mt-4'}>
                            <div className = {'svgInList'}>
                                <svg width="40" height="40" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M9.99998 19.9231C4.51962 19.9231 0.0769043 15.4803 0.0769043 9.99998C0.0769043 4.51962 4.51962 0.0769043 9.99998 0.0769043C15.4803 0.0769043 19.9231 4.51962 19.9231 9.99998C19.9231 15.4803 15.4803 19.9231 9.99998 19.9231ZM9.99998 18.5384C14.7156 18.5384 18.5384 14.7156 18.5384 9.99998C18.5384 5.28432 14.7156 1.46152 9.99998 1.46152C5.28432 1.46152 1.46152 5.28432 1.46152 9.99998C1.46152 14.7156 5.28432 18.5384 9.99998 18.5384ZM5.30532 10.0361C5.57196 9.76205 6.01026 9.75605 6.2843 10.0227L9.07136 12.7345L14.9914 6.84129C15.2624 6.57154 15.7007 6.57254 15.9705 6.84352C16.2402 7.11449 16.2392 7.55284 15.9683 7.82259L9.56532 14.1965C9.2974 14.4632 8.86506 14.4656 8.59411 14.202L5.31872 11.0151C5.04469 10.7484 5.03869 10.3101 5.30532 10.0361Z" fill="#F39930"></path></svg>
                            </div>
                            <h4>Надежный хостинг</h4>
                            <h5>Заботимся о стабильной работе сайтов, быстром доступе к ним, полной сохранности информации. 1 год в подарок.</h5>
                        </li>
                        <li className = {'list li2 mt-4'}>
                            <div className = {'svgInList'}>
                                <svg width="40" height="40" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M9.99998 19.9231C4.51962 19.9231 0.0769043 15.4803 0.0769043 9.99998C0.0769043 4.51962 4.51962 0.0769043 9.99998 0.0769043C15.4803 0.0769043 19.9231 4.51962 19.9231 9.99998C19.9231 15.4803 15.4803 19.9231 9.99998 19.9231ZM9.99998 18.5384C14.7156 18.5384 18.5384 14.7156 18.5384 9.99998C18.5384 5.28432 14.7156 1.46152 9.99998 1.46152C5.28432 1.46152 1.46152 5.28432 1.46152 9.99998C1.46152 14.7156 5.28432 18.5384 9.99998 18.5384ZM5.30532 10.0361C5.57196 9.76205 6.01026 9.75605 6.2843 10.0227L9.07136 12.7345L14.9914 6.84129C15.2624 6.57154 15.7007 6.57254 15.9705 6.84352C16.2402 7.11449 16.2392 7.55284 15.9683 7.82259L9.56532 14.1965C9.2974 14.4632 8.86506 14.4656 8.59411 14.202L5.31872 11.0151C5.04469 10.7484 5.03869 10.3101 5.30532 10.0361Z" fill="#F39930"></path></svg>
                            </div>
                            <h4>Понятная и простая система управления</h4>
                            <h5>Мы создадим элементы управления сайтом или приложением такими какими они вам нужны. Подключения к разным сервисам сделает ваше приложение гибким как штанинная змея. </h5>
                            <h5>Подарим вам любое свободное имя в зонах .RU, .РФ, .SU, .COM, .NET, .ORG, .MSK, .SPB, .NOV</h5>
                        </li>
                        <li className = {'list li3 mt-4'}>
                            <div className = {'svgInList'}>
                                <svg width="40" height="40" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path fill-rule="evenodd" clip-rule="evenodd" d="M9.99998 19.9231C4.51962 19.9231 0.0769043 15.4803 0.0769043 9.99998C0.0769043 4.51962 4.51962 0.0769043 9.99998 0.0769043C15.4803 0.0769043 19.9231 4.51962 19.9231 9.99998C19.9231 15.4803 15.4803 19.9231 9.99998 19.9231ZM9.99998 18.5384C14.7156 18.5384 18.5384 14.7156 18.5384 9.99998C18.5384 5.28432 14.7156 1.46152 9.99998 1.46152C5.28432 1.46152 1.46152 5.28432 1.46152 9.99998C1.46152 14.7156 5.28432 18.5384 9.99998 18.5384ZM5.30532 10.0361C5.57196 9.76205 6.01026 9.75605 6.2843 10.0227L9.07136 12.7345L14.9914 6.84129C15.2624 6.57154 15.7007 6.57254 15.9705 6.84352C16.2402 7.11449 16.2392 7.55284 15.9683 7.82259L9.56532 14.1965C9.2974 14.4632 8.86506 14.4656 8.59411 14.202L5.31872 11.0151C5.04469 10.7484 5.03869 10.3101 5.30532 10.0361Z" fill="#F39930"></path></svg>
                            </div>
                            <h4>Консультант</h4>
                            <h5>Консультации и советы по работе с сайтом или приложением</h5>
                        </li>
                    </ul>
                </div>
                <Stages/>

            </Container>
        </>

    )
}
